(function() {
    let $;
    if (typeof require == "function" && typeof module == "object") {
        $ = typeof jQuery != "undefined" ? jQuery : require("pqgrid").$;
    } else {
        $ = window.jQuery;
    }

    var pq = $.paramquery,
        grid = pq.strings = pq.pqGrid.regional.hi = {
            strAND: "तथा",
            strAddColLeft: "बाईं ओर कॉलम जोड़ें",
            strAddColRight: "दाईं ओर कॉलम जोड़ें",
            strAddColumn: "कॉलम जोड़ें",
            strAddRow: "पंक्ति जोड़ें",
            strAddRowAbove: "ऊपर पंक्ति जोड़ें",
            strAddRowBelow: "नीचे पंक्ति जोड़ें",
            strAddRows: "{0} पंक्तियाँ जोड़ें",
            strAlign: {
                bottom: "नीचे संरेखित करें",
                center: "केंद्र संरेखित करें",
                left: "बाएँ संरेखित करें",
                right: "दाएँ संरेखित करें",
                top: "शीर्ष संरेखित करें"
            },
            strAlignH: "क्षैतिज संरेखण",
            strAlignV: "लंबवत संरेखण",
            strApply: "आवेदन करें",
            strBlanks: "(रिक्त स्थान)",
            strBold: "मोटा पाठ्यांश",
            strBorder: "सीमा",
            strBorderColor: "सीमा रंग",
            strBorderStyle: "सीमा शैली",
            strBorders: {
                all: "सभी सीमाएँ",
                bottom: "निचली सीमा",
                horizontal: "क्षैतिज सीमा",
                inner: "भीतरी सीमा",
                left: "वाम सीमा",
                none: "कोई सीमा नहीं",
                outer: "बाहरी सीमा",
                right: "दाहिनी सीमा",
                top: "शीर्ष सीमा",
                vertical: "लंबवत सीमा"
            },
            strCancel: "रद्द करें",
            strClear: "स्पष्ट",
            strClearColor: "साफ़ रंग",
            strClearFilter: "फ़िल्टर साफ़ करें",
            strClearText: "साफ़ पाठ",
            strCollapse: "पैनल संक्षिप्त करें",
            strComment: "टिप्पणी करें",
            strCondition: "Condition:",
            strConditions: {
                "": "-- कोई नहीं --",
                begin: "से शुरू होता है",
                between: "बीच में",
                contain: "शामिल है",
                empty: "ख़ाली",
                end: "के साथ समाप्त होता है",
                equal: "बराबर",
                great: "से भी बड़ा",
                gte: "से बड़ा या बराबर",
                less: "से भी कम",
                lte: "से कम या बराबर",
                notbegin: "से शुरू नहीं होता",
                notcontain: "शामिल नहीं है",
                notempty: "खाली नहीं",
                notend: "के साथ समाप्त नहीं होता",
                notequal: "बराबर नहीं",
                range: "[रेंज]",
                regexp: "नियमित अभिव्यक्ति"
            },
            strCopy: "प्रतिलिपि",
            strCut: "काटो",
            strDelete: "हटाएँ",
            strDeleteColumn: "कॉलम हटाएं",
            strDeleteRow: "पंक्ति हटाएँ",
            strDownloadXlsx: "एक्सेल फ़ाइल डाउनलोड करें",
            strEdit: "संपादित करें",
            strExitFullScreen: "पूर्ण स्क्रीन से बाहर निकलें",
            strExpand: "पैनल का विस्तार करें",
            strExport: "डेटा निर्यात करें",
            strFillColor: "रंग भरें",
            strFontFamily: "फ़ॉन्ट परिवार",
            strFontSize: "फ़ॉन्ट आकार",
            strFormat: "कोशिकाओं को प्रारूपित करें",
            strFormatMenu: {
                Accounting: "लेखांकन",
                Currency: "मुद्रा",
                Custom: "कस्टम",
                DateTime: "दिनांक समय",
                Fixed: "दशमलव",
                Fraction: "अंश",
                FullDate: "पूर्ण तिथि",
                General: "सामान्य",
                Int: "पूर्णांक",
                LongDate: "लंबी तारीख",
                MediumDate: "मध्यम तिथि",
                Note: "नोट: * वाले प्रारूप उपयोगकर्ता स्थान के अनुसार बदलते हैं।",
                Percent: "प्रतिशत",
                Scientific: "वैज्ञानिक",
                ShortDate: "लघु तिथि",
                Standard: "मानक",
                Text: "पाठ",
                Time: "समय"
            },
            strFormulas: {
                ABS: [
                    "ABS(number)",
                    "किसी संख्या का पूर्ण मान लौटाता है.किसी संख्या का निरपेक्ष मान बिना चिह्न वाली संख्या है।"
                ],
                ACOS: [
                    "ACOS(number)",
                    "किसी संख्या की आर्ककोसाइन या व्युत्क्रम कोसाइन लौटाता है।आर्ककोसाइन वह कोण है जिसकी कोसाइन संख्या होती है।लौटाया गया कोण 0 (शून्य) से पाई तक की सीमा में रेडियन में दिया गया है।"
                ],
                AND: [
                    "तथा(तार्किक1, [तार्किक2], ...)",
                    "यदि इसके सभी तर्क सत्य पर मूल्यांकन करते हैं तो सत्य लौटाता है, और यदि एक या अधिक तर्क गलत पर मूल्यांकन करते हैं तो गलत लौटाता है।"
                ],
                ASIN: [
                    "ASIN(number)",
                    "किसी संख्या की आर्कसाइन या व्युत्क्रम साइन लौटाता है।आर्कसाइन वह कोण है जिसकी साइन संख्या है।लौटाया गया कोण -pi/2 से pi/2 की सीमा में रेडियन में दिया गया है।"
                ],
                ATAN: [
                    "ATAN(number)",
                    "किसी संख्या का आर्कटेंजेंट, या व्युत्क्रम टेंगेंट लौटाता है।चापस्पर्शरेखा वह कोण है जिसकी स्पर्शरेखा संख्या होती है।लौटाया गया कोण -pi/2 से pi/2 की सीमा में रेडियन में दिया गया है।"
                ],
                AVERAGE: [
                    "औसत(संख्या 1, [संख्या 2], ...)",
                    "तर्कों का औसत (अंकगणितीय माध्य) लौटाता है।उदाहरण के लिए, यदि श्रेणी A1:A20 में संख्याएँ हैं, तो सूत्र =AVERAGE(A1:A20) उन संख्याओं का औसत लौटाता है।"
                ],
                AVERAGEIF: [
                    "AVERAGEIF(रेंज, मानदंड, [औसत_रेंज])",
                    "किसी श्रेणी में सभी कोशिकाओं का औसत (अंकगणितीय माध्य) लौटाता है जो किसी दिए गए मानदंड को पूरा करते हैं।"
                ],
                AVERAGEIFS: [
                    "AVERAGEIFS(औसत_रेंज, मानदंड_रेंज1, मानदंड1, [मानदंड_रेंज2, मानदंड2], ...)",
                    "एकाधिक मानदंडों को पूरा करने वाली सभी कोशिकाओं का औसत (अंकगणितीय माध्य) लौटाता है।"
                ],
                CEILING: [
                    "छत(संख्या, महत्व)",
                    "संख्या को शून्य से दूर, महत्व के निकटतम गुणक में पूर्णांकित करके लौटाता है।उदाहरण के लिए, यदि आप अपनी कीमतों में पैनी का उपयोग करने से बचना चाहते हैं और आपके उत्पाद की कीमत $4.42 है, तो कीमतों को निकटतम निकेल तक पूर्णांकित करने के लिए सूत्र =CEILING(4.42,0.05) का उपयोग करें।"
                ],
                CHAR: [
                    "CHAR(number)",
                    "किसी संख्या द्वारा निर्दिष्ट वर्ण लौटाता है."
                ],
                CHOOSE: [
                    "चुनें(index_num, value1, [value2], ...)",
                    "यदि Index_num 1 है, तो CHOOSE रिटर्न मान1 देता है;यदि यह 2 है, तो रिटर्न मान2 चुनें;और इसी तरह।"
                ],
                CODE: [
                    "CODE(text)",
                    "टेक्स्ट स्ट्रिंग में पहले अक्षर के लिए एक संख्यात्मक कोड लौटाता है।"
                ],
                COLUMN: [
                    "COLUMN()",
                    "उस सेल का संदर्भ लौटाता है जिसमें COLUMN फ़ंक्शन दिखाई देता है।"
                ],
                COLUMNS: [
                    "COLUMNS(array)",
                    "किसी सरणी या संदर्भ में स्तंभों की संख्या लौटाता है।"
                ],
                CONCATENATE: [
                    "CONCATENATE(पाठ1, [पाठ2], ...)",
                    "दो या दो से अधिक टेक्स्ट स्ट्रिंग को एक स्ट्रिंग में जोड़ें।"
                ],
                COS: [
                    "COS(number)",
                    "दिए गए कोण की कोज्या (रेडियन में) लौटाता है।"
                ],
                COUNT: [
                    "गिनती(मान1, [मान2], ...)",
                    "उन कक्षों की संख्या की गणना करता है जिनमें संख्याएँ होती हैं, और तर्कों की सूची में संख्याओं की गणना करता है।"
                ],
                COUNTA: [
                    "COUNTA(मान1, [मान2], ...)",
                    "COUNTA फ़ंक्शन उन कक्षों की संख्या की गणना करता है जो किसी श्रेणी में खाली नहीं हैं।"
                ],
                COUNTBLANK: [
                    "COUNTBLANK(range)",
                    "कोशिकाओं की एक निर्दिष्ट श्रेणी में खाली कोशिकाओं की गणना करता है।"
                ],
                COUNTIF: [
                    "काउंटिफ़(सीमा, मानदंड)",
                    "किसी मानदंड को पूरा करने वाली कोशिकाओं की संख्या की गणना करता है;उदाहरण के लिए, ग्राहक सूची में कोई विशेष शहर कितनी बार दिखाई देता है इसकी गणना करना।"
                ],
                COUNTIFS: [
                    "COUNTIFS(मानदंड_श्रेणी1, मानदंड1, [मानदंड_श्रेणी2, मानदंड2]…)",
                    "कई श्रेणियों में कोशिकाओं पर मानदंड लागू करता है और सभी मानदंडों को पूरा करने की संख्या की गणना करता है।"
                ],
                DATE: [
                    "DATE(year,month,day)",
                    "अनुक्रमिक क्रमांक लौटाता है जो किसी विशेष तिथि को दर्शाता है।"
                ],
                DATEDIF: [
                    "DATEDIF(start_date,end_date,unit)",
                    "दो तिथियों के बीच दिनों, महीनों या वर्षों की संख्या की गणना करता है।इकाई 'Y', 'M' या 'D' हो सकती है।"
                ],
                DATEVALUE: [
                    "DATEVALUE(date_text)",
                    "टेक्स्ट के रूप में संग्रहीत दिनांक को एक सीरियल नंबर में परिवर्तित करता है जिसे एक्सेल दिनांक के रूप में पहचानता है।उदाहरण के लिए, सूत्र =DATEVALUE('1/1/2008') 39448 लौटाता है।"
                ],
                DAY: [
                    "DAY(serial_number)",
                    "किसी दिनांक का दिन लौटाता है, जिसे क्रमांक संख्या द्वारा दर्शाया जाता है।"
                ],
                DAYS: [
                    "दिन(अंत_दिनांक, आरंभ_दिनांक)",
                    "दो तिथियों के बीच दिनों की संख्या लौटाता है।"
                ],
                DEGREES: [
                    "DEGREES(angle)",
                    "रेडियन को डिग्री में परिवर्तित करता है।"
                ],
                EOMONTH: [
                    "EOMONTH(प्रारंभ तिथि, महीने)",
                    "महीने के अंतिम दिन के लिए क्रमांक लौटाता है जो कि प्रारंभ_दिनांक से पहले या बाद के महीनों की संकेतित संख्या है।"
                ],
                EXP: [
                    "EXP(number)",
                    "ई को संख्या की घात तक बढ़ा कर लौटाता है।"
                ],
                FIND: [
                    "ढूँढें(find_text, inside_text, [start_num])",
                    "दूसरी टेक्स्ट स्ट्रिंग के भीतर एक टेक्स्ट स्ट्रिंग का पता लगाता है, और दूसरी टेक्स्ट स्ट्रिंग के पहले अक्षर से पहली टेक्स्ट स्ट्रिंग की शुरुआती स्थिति की संख्या लौटाता है।"
                ],
                FLOOR: [
                    "मंजिल(संख्या, महत्व)",
                    "संख्या को शून्य की ओर, महत्व के निकटतम गुणक तक पूर्णांकित करता है।"
                ],
                HLOOKUP: [
                    "HLOOKUP(लुकअप_वैल्यू, टेबल_एरे, row_index_num, [रेंज_लुकअप])",
                    "किसी तालिका या मानों की सरणी की शीर्ष पंक्ति में एक मान की खोज करता है, और फिर तालिका या सरणी में आपके द्वारा निर्दिष्ट पंक्ति से उसी कॉलम में एक मान लौटाता है।"
                ],
                HOUR: [
                    "HOUR(serial_number)",
                    "समय मान का घंटा लौटाता है.घंटा पूर्णांक के रूप में दिया गया है, 0 (12:00 पूर्वाह्न) से 23 (11:00 अपराह्न) तक।"
                ],
                HYPERLINK: [
                    "हाइपरलिंक(यूआरएल, [दोस्ताना_नाम])",
                    "एक शॉर्टकट बनाता है जो आपके द्वारा किसी सेल पर क्लिक करने पर इंटरनेट में किसी अन्य स्थान पर चला जाता है"
                ],
                IF: [
                    "IF(तार्किक_परीक्षण, value_if_true, [value_if_false])",
                    "यदि कोई शर्त सत्य है तो एक मान लौटाता है और यदि वह गलत है तो दूसरा मान देता है।"
                ],
                INDEX: [
                    "सूचकांक (सरणी, पंक्ति संख्या, [स्तंभ संख्या])",
                    "पंक्ति और स्तंभ संख्या अनुक्रमणिका द्वारा चयनित किसी तालिका या सरणी में किसी तत्व का मान लौटाता है।"
                ],
                INDIRECT: [
                    "अप्रत्यक्ष(ref_text, [a1])",
                    "टेक्स्ट स्ट्रिंग द्वारा निर्दिष्ट संदर्भ लौटाता है।उनकी सामग्री प्रदर्शित करने के लिए संदर्भों का तुरंत मूल्यांकन किया जाता है।"
                ],
                ISBLANK: [
                    "ISBLANK(value)",
                    "यदि मान रिक्त है तो सत्य लौटाता है"
                ],
                LARGE: [
                    "बड़ा(सरणी, के)",
                    "डेटा सेट में k-वां सबसे बड़ा मान लौटाता है।"
                ],
                LEFT: [
                    "बाएँ (पाठ, [num_chars])",
                    "आपके द्वारा निर्दिष्ट वर्णों की संख्या के आधार पर, टेक्स्ट स्ट्रिंग में पहला वर्ण या वर्ण लौटाता है।"
                ],
                LEN: [
                    "LEN(text)",
                    "टेक्स्ट स्ट्रिंग में वर्णों की संख्या लौटाता है।"
                ],
                LOOKUP: [
                    "लुकअप(लुकअप_वैल्यू, लुकअप_वेक्टर, [परिणाम_वेक्टर])",
                    "किसी मान को एक-पंक्ति या एक-स्तंभ श्रेणी (वेक्टर के रूप में जाना जाता है) में देखता है और दूसरी एक-पंक्ति या एक-स्तंभ श्रेणी में उसी स्थिति से एक मान लौटाता है।"
                ],
                LOWER: [
                    "LOWER(text)",
                    "टेक्स्ट स्ट्रिंग के सभी अपरकेस अक्षरों को लोअरकेस में परिवर्तित करता है।"
                ],
                MATCH: [
                    "मैच(लुकअप_वैल्यू, लुकअप_एरे, [मैच_टाइप])",
                    "कक्षों की श्रेणी में किसी निर्दिष्ट आइटम की खोज करता है, और फिर श्रेणी में उस आइटम की सापेक्ष स्थिति लौटाता है।मैच_टाइप हो सकता है: वाइल्डकार्ड का उपयोग करने के विकल्प के साथ सटीक मिलान के लिए 0;1 (डिफ़ॉल्ट) से कम के लिए, लुकअप_अरे तर्क में मानों को आरोही क्रम में रखा जाना चाहिए;-1 से अधिक के लिए, लुकअप_अरे तर्क में मानों को अवरोही क्रम में रखा जाना चाहिए।"
                ],
                MAX: [
                    "MAX(संख्या 1, [संख्या 2], ...)",
                    "मानों के एक सेट में सबसे बड़ा मान लौटाता है।"
                ],
                MEDIAN: [
                    "माध्यिका(संख्या 1, [संख्या 2], ...)",
                    "दी गई संख्याओं का माध्य लौटाता है.माध्यिका संख्याओं के समूह के बीच की संख्या है।"
                ],
                MID: [
                    "मध्य(पाठ, प्रारंभ_नम, संख्या_वर्ण)",
                    "आपके द्वारा निर्दिष्ट वर्णों की संख्या के आधार पर, आपके द्वारा निर्दिष्ट स्थान से शुरू करके, टेक्स्ट स्ट्रिंग से वर्णों की एक विशिष्ट संख्या लौटाता है।"
                ],
                MIN: [
                    "न्यूनतम(संख्या 1, [संख्या 2], ...)",
                    "मानों के समूह में सबसे छोटी संख्या लौटाता है।"
                ],
                MODE: [
                    "MODE(number1,[number2],...)",
                    "किसी सरणी या डेटा की श्रेणी में सबसे अधिक बार होने वाला या दोहराव वाला मान लौटाता है।"
                ],
                MONTH: [
                    "MONTH(serial_number)",
                    "क्रमांक द्वारा दर्शाई गई तारीख का महीना लौटाता है।महीना एक पूर्णांक के रूप में दिया गया है, 1 (जनवरी) से 12 (दिसंबर) तक।"
                ],
                OR: [
                    "या(तार्किक1, [तार्किक2], ...)",
                    "यदि इसके किसी भी तर्क का मूल्यांकन सत्य पर होता है, तो यह सत्य लौटाता है, और यदि इसके सभी तर्कों का मूल्यांकन गलत पर होता है, तो यह गलत लौटाता है।"
                ],
                PI: [
                    "PI()",
                    "संख्या 3.14159265358979, गणितीय स्थिरांक pi लौटाता है।"
                ],
                POWER: [
                    "शक्ति(संख्या, शक्ति)",
                    "किसी संख्या का परिणाम घात तक लौटाता है।"
                ],
                PRODUCT: [
                    "उत्पाद(संख्या 1, [संख्या 2], ...)",
                    "तर्क के रूप में दी गई सभी संख्याओं को गुणा करता है और उत्पाद लौटाता है।उत्पाद(ए1:ए3, सी1:सी3) =ए1 * ए2 * ए3 * सी1 * सी2 * सी3 के बराबर है।"
                ],
                PROPER: [
                    "PROPER(text)",
                    "किसी पाठ मान के प्रत्येक शब्द के पहले अक्षर को बड़ा करता है।"
                ],
                RADIANS: [
                    "RADIANS(angle)",
                    "डिग्री को रेडियन में परिवर्तित करता है।"
                ],
                RAND: [
                    "RAND()",
                    "0 से अधिक या उसके बराबर और 1 से कम समान रूप से वितरित यादृच्छिक वास्तविक संख्या लौटाता है।"
                ],
                RANK: [
                    "RANK(number,ref,[order])",
                    "संख्याओं की सूची में किसी संख्या की रैंक लौटाता है।"
                ],
                RATE: [
                    "",
                    ""
                ],
                REPLACE: [
                    "बदलें(पुराना_पाठ, प्रारंभ_नम, संख्या_चार, नया_पाठ)",
                    "आपके द्वारा निर्दिष्ट वर्णों की संख्या के आधार पर, टेक्स्ट स्ट्रिंग के भाग को एक अलग टेक्स्ट स्ट्रिंग से बदल देता है।"
                ],
                REPT: [
                    "आरईपीटी(पाठ, संख्या_बार)",
                    "पाठ को एक निश्चित संख्या में बार दोहराता है।"
                ],
                RIGHT: [
                    "RIGHT(text,[num_chars])",
                    "आपके द्वारा निर्दिष्ट वर्णों की संख्या के आधार पर, टेक्स्ट स्ट्रिंग में अंतिम वर्ण या वर्ण लौटाता है।"
                ],
                ROUND: [
                    "दौर(संख्या, संख्या_अंक)",
                    "किसी संख्या को अंकों की एक निर्दिष्ट संख्या में पूर्णांकित करना।"
                ],
                ROUNDDOWN: [
                    "राउंडडाउन(संख्या, संख्या_अंक)",
                    "किसी संख्या को शून्य की ओर पूर्णांकित करता है।"
                ],
                ROUNDUP: [
                    "राउंडअप(संख्या, संख्या_अंक)",
                    "किसी संख्या को 0 (शून्य) से दूर पूर्णांकित करता है।"
                ],
                ROW: [
                    "ROW()",
                    "उस सेल का संदर्भ लौटाता है जिसमें ROW फ़ंक्शन दिखाई देता है।"
                ],
                ROWS: [
                    "ROWS(array)",
                    "किसी संदर्भ या सरणी में पंक्तियों की संख्या लौटाता है।"
                ],
                SEARCH: [
                    "SEARCH(find_text,within_text,[start_num])",
                    "दूसरी टेक्स्ट स्ट्रिंग के भीतर एक टेक्स्ट स्ट्रिंग का पता लगाएं, और दूसरी टेक्स्ट स्ट्रिंग के पहले अक्षर से पहली टेक्स्ट स्ट्रिंग की शुरुआती स्थिति की संख्या लौटाएं।"
                ],
                SIN: [
                    "SIN(number)",
                    "दिए गए कोण की ज्या (रेडियन में) लौटाता है।"
                ],
                SMALL: [
                    "छोटा(सरणी, के)",
                    "डेटा सेट में k-वां सबसे छोटा मान लौटाता है।"
                ],
                SQRT: [
                    "SQRT(number)",
                    "एक सकारात्मक वर्गमूल लौटाता है."
                ],
                STDEV: [
                    "STDEV(number1,[number2],...)",
                    "नमूने के आधार पर मानक विचलन का अनुमान लगाता है।मानक विचलन इस बात का माप है कि औसत मूल्य (माध्य) से मूल्य कितने व्यापक रूप से फैले हुए हैं।"
                ],
                STDEVP: [
                    "STDEVP(number1,[number2],...)",
                    "तर्क के रूप में दी गई संपूर्ण जनसंख्या के आधार पर मानक विचलन की गणना करता है।"
                ],
                SUBSTITUTE: [
                    "स्थानापन्न(पाठ, पुराना_पाठ, नया_पाठ, [instance_num])",
                    "टेक्स्ट स्ट्रिंग में पुराने_टेक्स्ट के स्थान पर new_text प्रतिस्थापित करता है।"
                ],
                SUM: [
                    "SUM(number1,[number2],...)",
                    "अपने तर्क जोड़ता है.आप अलग-अलग मान, सेल संदर्भ या श्रेणियाँ या तीनों का मिश्रण जोड़ सकते हैं।"
                ],
                SUMIF: [
                    "SUMIF(श्रेणी, मानदंड, [sum_range])",
                    "आपके द्वारा निर्दिष्ट मानदंडों को पूरा करने वाली श्रेणी में मान जोड़ता है"
                ],
                SUMIFS: [
                    "SUMIFS(योग_श्रेणी, मानदंड_श्रेणी1, मानदंड1, [मानदंड_श्रेणी2, मानदंड2], ...)",
                    "अपने सभी तर्कों को जोड़ता है जो कई मानदंडों को पूरा करते हैं।"
                ],
                SUMPRODUCT: [
                    "SUMPRODUCT(सरणी1, [सरणी2], [सरणी3], ...)",
                    "दिए गए सरणियों में संबंधित घटकों को गुणा करता है, और उन उत्पादों का योग लौटाता है।"
                ],
                TAN: [
                    "TAN(number)",
                    "दिए गए कोण की स्पर्श रेखा (रेडियन में) लौटाता है।"
                ],
                TEXT: [
                    "पाठ(वह मान जिसे आप प्रारूपित करना चाहते हैं, \"प्रारूप कोड जिसे आप लागू करना चाहते हैं\")",
                    "टेक्स्ट फ़ंक्शन आपको फ़ॉर्मेट कोड के साथ फ़ॉर्मेटिंग लागू करके किसी संख्या के प्रकट होने के तरीके को बदलने देता है।"
                ],
                TIME: [
                    "समय(घंटा, मिनट, सेकंड)",
                    "किसी विशेष समय के लिए दशमलव संख्या लौटाता है."
                ],
                TIMEVALUE: [
                    "TIMEVALUE(time_text)",
                    "टेक्स्ट स्ट्रिंग द्वारा दर्शाए गए समय की दशमलव संख्या लौटाता है।दशमलव संख्या 0 (शून्य) से 0.99988426 तक का मान है, जो 0:00:00 (12:00:00 पूर्वाह्न) से 23:59:59 (11:59:59 अपराह्न) तक के समय को दर्शाता है।"
                ],
                TODAY: [
                    "TODAY()",
                    "वर्तमान दिनांक का क्रमांक लौटाता है."
                ],
                TRIM: [
                    "TRIM(text)",
                    "शब्दों के बीच एकल रिक्त स्थान को छोड़कर पाठ से सभी रिक्त स्थान हटा देता है।"
                ],
                TRUNC: [
                    "ट्रंक(संख्या, [num_digits])",
                    "संख्या के भिन्नात्मक भाग को हटाकर किसी संख्या को पूर्णांक में विभाजित करता है।"
                ],
                UPPER: [
                    "UPPER(text)",
                    "टेक्स्ट को अपरकेस में परिवर्तित करता है।"
                ],
                VALUE: [
                    "VALUE(text)",
                    "किसी संख्या का प्रतिनिधित्व करने वाली टेक्स्ट स्ट्रिंग को संख्या में परिवर्तित करता है।"
                ],
                VAR: [
                    "VAR(number1,[number2],...)",
                    "एक नमूने के आधार पर भिन्नता का अनुमान लगाता है।"
                ],
                VARP: [
                    "VARP(number1,[number2],...)",
                    "संपूर्ण जनसंख्या के आधार पर विचरण की गणना करता है।"
                ],
                VLOOKUP: [
                    "VLOOKUP (लुकअप_वैल्यू, टेबल_एरे, col_index_num, [रेंज_लुकअप])",
                    "किसी तालिका या श्रेणी में पंक्ति के अनुसार मान देखें।उदाहरण के लिए, किसी ऑटोमोटिव हिस्से की कीमत उसके पार्ट नंबर के आधार पर देखें।"
                ],
                YEAR: [
                    "YEAR(serial_number)",
                    "दिनांक के अनुरूप वर्ष लौटाता है.वर्ष 1900-9999 की सीमा में पूर्णांक के रूप में लौटाया जाता है।"
                ]
            },
            strFreezeFirstCol: "पहले कॉलम को फ़्रीज़ करें",
            strFreezePanes: "शीशे फ्रीज करें",
            strFreezePanesUndo: "शीशे खोलो",
            strFreezeTopRow: "पहली पंक्ति को फ़्रीज़ करें",
            strFrozenCols: "जमे हुए कॉलम",
            strFrozenRows: "जमी हुई पंक्तियाँ",
            strFullScreen: "पूर्ण स्क्रीन",
            strGroup_fixCols: "कॉलम ठीक करें",
            strGroup_grandSummary: "भव्य सारांश",
            strGroup_header: "स्तंभ दर समूह ड्रॉप करें",
            strGroup_merge: "कोशिकाओं को मर्ज करें",
            strHideCols: "कॉलम छुपाएं",
            strHideRows: "पंक्तियाँ छिपाएँ",
            strImport: "डेटा आयात करें",
            strImportPic: "फ़्लोटिंग छवि डालें",
            strImportPicCell: "सेल में छवि डालें",
            strInsertColumn: "कॉलम सम्मिलित करें",
            strInsertRow: "पंक्ति सम्मिलित करें",
            strInsertRows: "{0} पंक्तियाँ सम्मिलित करें",
            strItalic: "इटैलिक पाठ",
            strLabel: "लेबल",
            strLink: "लिंक",
            strLoading: "लोड हो रहा है",
            strLocal: "hi",
            strLockCells: "कोशिकाओं को लॉक करें",
            strMenu: {
                export: "निर्यात योग्य कॉलम",
                filter: "फ़िल्टर करें",
                hideCols: "दृश्यमान स्तंभ"
            },
            strMerge: "कोशिकाओं को मर्ज करें",
            strName: "नाम",
            strNextResult: "अगला परिणाम",
            strNoRows: "प्रदर्शित करने के लिए कोई पंक्तियाँ नहीं.",
            strNothingFound: "कुछ नहीं मिला",
            strOR: "या",
            strOk: "ठीक है",
            strOpen: "खुला",
            strPaste: "चिपकाएँ",
            strPrevResult: "पिछला परिणाम",
            strRedo: "पुनः करें",
            strRename: "नाम बदलें",
            strSearch: "खोजें",
            strSelectAll: "सभी का चयन करें",
            strSelectedmatches: "{1} मिलानों में से {0} चयनित",
            strShowCols: "कॉलम दिखाएँ",
            strShowRows: "पंक्तियाँ दिखाएँ",
            strTP_aggPH: "समुच्चय के लिए कॉलम छोड़ें",
            strTP_aggPane: "समुच्चय",
            strTP_colPH: "कॉलम ग्रुपिंग के लिए कॉलम ड्रॉप करें",
            strTP_colPane: "समूह स्तंभ",
            strTP_pivot: "धुरी मोड",
            strTP_rowPH: "पंक्ति समूहन के लिए कॉलम ड्रॉप करें",
            strTP_rowPane: "समूह पंक्तियाँ",
            strTabAdd: "नई शीट",
            strTabClose: "शीट हटाओ",
            strTabHide: "चादर छिपाओ",
            strTabName: "sheet{0}",
            strTabRemove: "{0} को स्थायी रूप से हटा दिया जाएगा.\r\nक्या आपको यकीन है?",
            strTabRename: "शीट का नाम बदलें",
            strTabShow: "शीट दिखाओ",
            strTextColor: "पाठ का रंग",
            strUnderline: "पाठ को रेखांकित करें",
            strUndo: "पूर्ववत करें",
            strUnhide: "उजागर करें",
            strUnmerge: "कोशिकाओं को अलग करें",
            strUpdate: "अद्यतन करें",
            strWrap: "पाठ लपेटें"
        },
        pager = pq.pqPager.regional.hi = {
            strDisplay: "{2} आइटमों में से {0} से {1} प्रदर्शित करना।",
            strFirstPage: "प्रथम पृष्ठ",
            strLastPage: "अंतिम पृष्ठ",
            strNextPage: "अगला पृष्ठ",
            strPage: "{1} में से पृष्ठ {0}",
            strPrevPage: "पिछला पृष्ठ",
            strRefresh: "ताज़ा करें",
            strRpp: "प्रति पृष्ठ रिकॉर्ड: {0}"
        };

    $.extend(pq.pqGrid.defaults, grid);
    $.extend(pq.pqPager.defaults, pager);

})();