(function() {
    let $;
    if (typeof require == "function" && typeof module == "object") {
        $ = typeof jQuery != "undefined" ? jQuery : require("pqgrid").$;
    } else {
        $ = window.jQuery;
    }

    var pq = $.paramquery,
        grid = pq.strings = pq.pqGrid.regional.ru = {
            strAND: "И",
            strAddColLeft: "Добавить столбец слева",
            strAddColRight: "Добавить столбец справа",
            strAddColumn: "Добавить столбец",
            strAddRow: "Добавить строку",
            strAddRowAbove: "Добавить строку выше",
            strAddRowBelow: "Добавить строку ниже",
            strAddRows: "Добавить {0} строк",
            strAlign: {
                bottom: "Выровнять по нижнему краю",
                center: "Выровнять по центру",
                left: "Выравнивание по левому краю",
                right: "Выровнять по правому краю",
                top: "Выровнять по верхнему краю"
            },
            strAlignH: "Горизонтальное выравнивание",
            strAlignV: "Вертикальное выравнивание",
            strApply: "Применить",
            strBlanks: "(Пробелы)",
            strBold: "Жирный текст",
            strBorder: "Граница",
            strBorderColor: "Цвет границы",
            strBorderStyle: "Стиль границы",
            strBorders: {
                all: "Все границы",
                bottom: "Нижняя граница",
                horizontal: "Горизонтальная граница",
                inner: "Внутренняя граница",
                left: "Левая граница",
                none: "Нет границ",
                outer: "Внешняя граница",
                right: "Правая граница",
                top: "Верхняя граница",
                vertical: "Вертикальная граница"
            },
            strCancel: "Отмена",
            strClear: "Прозрачный",
            strClearColor: "Прозрачный цвет",
            strClearFilter: "Очистить фильтр",
            strClearText: "Очистить текст",
            strCollapse: "Свернуть панель",
            strComment: "Комментарий",
            strCondition: "Condition:",
            strConditions: {
                "": "-- Нет --",
                begin: "Начинается с",
                between: "Между",
                contain: "Содержит",
                empty: "Пустой",
                end: "Заканчивается на",
                equal: "Равно",
                great: "Больше, чем",
                gte: "Больше или равно",
                less: "Менее чем",
                lte: "Меньше или равно",
                notbegin: "Не начинается с",
                notcontain: "Не содержит",
                notempty: "Не пустой",
                notend: "Не заканчивается",
                notequal: "Не равно",
                range: "[Диапазон]",
                regexp: "Регулярное выражение"
            },
            strCopy: "Копировать",
            strCut: "Вырезать",
            strDelete: "Удалить",
            strDeleteColumn: "Удалить столбец",
            strDeleteRow: "Удалить строку",
            strDownloadXlsx: "Скачать файл Excel",
            strEdit: "Изменить",
            strExitFullScreen: "Выйти из полноэкранного режима",
            strExpand: "Развернуть панель",
            strExport: "Экспорт данных",
            strFillColor: "Цвет заливки",
            strFontFamily: "Семейство шрифтов",
            strFontSize: "Размер шрифта",
            strFormat: "Форматирование ячеек",
            strFormatMenu: {
                Accounting: "Бухгалтерский учет",
                Currency: "Валюта",
                Custom: "Пользовательский",
                DateTime: "Дата Время",
                Fixed: "Десятичный",
                Fraction: "Фракция",
                FullDate: "Полная дата",
                General: "Общий",
                Int: "Целое число",
                LongDate: "Длинное свидание",
                MediumDate: "Средняя дата",
                Note: "Примечание. Форматы со знаком * изменяются в зависимости от языкового стандарта пользователя.",
                Percent: "Процент",
                Scientific: "Научный",
                ShortDate: "Короткое свидание",
                Standard: "Стандартный",
                Text: "Текст",
                Time: "Время"
            },
            strFormulas: {
                ABS: [
                    "ABS(number)",
                    "Возвращает абсолютное значение числа.Абсолютное значение числа – это число без знака."
                ],
                ACOS: [
                    "ACOS(number)",
                    "Возвращает арккосинус или обратный косинус числа.Арккосинус – это угол, косинус которого является числом.Возвращаемый угол задается в радианах в диапазоне от 0 (ноль) до числа пи."
                ],
                AND: [
                    "И(логический1, [логический2], ...)",
                    "Возвращает TRUE, если все его аргументы оцениваются как TRUE, и возвращает FALSE, если один или несколько аргументов оцениваются как FALSE."
                ],
                ASIN: [
                    "ASIN(number)",
                    "Возвращает арксинус или обратный синус числа.Арксинус – это угол, синус которого является числом.Возвращаемый угол задается в радианах в диапазоне от -pi/2 до pi/2."
                ],
                ATAN: [
                    "ATAN(number)",
                    "Возвращает арктангенс или обратный тангенс числа.Арктангенс — это угол, тангенс которого является числом.Возвращаемый угол задается в радианах в диапазоне от -pi/2 до pi/2."
                ],
                AVERAGE: [
                    "СРЗНАЧ(число1, [число2], ...)",
                    "Возвращает среднее арифметическое значение аргументов.Например, если диапазон A1:A20 содержит числа, формула =СРЗНАЧ(A1:A20) возвращает среднее значение этих чисел."
                ],
                AVERAGEIF: [
                    "СРЗНАЧЕСЛИ(диапазон; критерии; [средний_диапазон])",
                    "Возвращает среднее арифметическое значение всех ячеек диапазона, соответствующих заданным критериям."
                ],
                AVERAGEIFS: [
                    "СРЗНАЧЕСЛИ(диапазон_среднего, диапазон_критерия1, критерий1, [диапазон_критерия2, критерий2], ...)",
                    "Возвращает среднее арифметическое значение всех ячеек, соответствующих нескольким критериям."
                ],
                CEILING: [
                    "ПОТОЛОК(число, значение)",
                    "Возвращает число, округленное в большую сторону от нуля до ближайшего значения, кратного значению.Например, если вы хотите избежать использования копеек в ценах, а цена вашего продукта составляет 4,42 доллара США, используйте формулу =ПОТОЛОК(4,42,0,05), чтобы округлить цены до ближайшего никеля."
                ],
                CHAR: [
                    "CHAR(number)",
                    "Возвращает символ, указанный числом."
                ],
                CHOOSE: [
                    "ВЫБЕРИТЕ(номер_индекса, значение1, [значение2], ...)",
                    "Если index_num равен 1, CHOOSE возвращает значение1;если оно равно 2, CHOOSE возвращает значение2;и так далее."
                ],
                CODE: [
                    "CODE(text)",
                    "Возвращает числовой код первого символа текстовой строки."
                ],
                COLUMN: [
                    "COLUMN()",
                    "Возвращает ссылку на ячейку, в которой присутствует функция СТОЛБЕЦ."
                ],
                COLUMNS: [
                    "COLUMNS(array)",
                    "Возвращает количество столбцов в массиве или ссылке."
                ],
                CONCATENATE: [
                    "СЦЕПИТЬ(текст1, [текст2], ...)",
                    "объединить две или более текстовые строки в одну строку."
                ],
                COS: [
                    "COS(number)",
                    "Возвращает косинус заданного угла (в радианах)."
                ],
                COUNT: [
                    "COUNT(значение1, [значение2], ...)",
                    "Подсчитывает количество ячеек, содержащих числа, и числа в списке аргументов."
                ],
                COUNTA: [
                    "СЧЕТЗ(значение1, [значение2], ...)",
                    "Функция СЧЕТЗ подсчитывает количество непустых ячеек в диапазоне."
                ],
                COUNTBLANK: [
                    "COUNTBLANK(range)",
                    "Подсчитывает пустые ячейки в указанном диапазоне ячеек."
                ],
                COUNTIF: [
                    "СЧЁТЕСЛИ(диапазон, критерий)",
                    "подсчитывает количество ячеек, соответствующих критерию;например, чтобы подсчитать, сколько раз определенный город появляется в списке клиентов."
                ],
                COUNTIFS: [
                    "COUNTIFS(диапазон_критерия1, критерий1, [диапазон_критерия2, критерий2]…)",
                    "Применяет критерии к ячейкам в нескольких диапазонах и подсчитывает количество совпадений всех критериев."
                ],
                DATE: [
                    "DATE(year,month,day)",
                    "возвращает последовательный серийный номер, представляющий определенную дату."
                ],
                DATEDIF: [
                    "DATEDIF(start_date,end_date,unit)",
                    "Вычисляет количество дней, месяцев или лет между двумя датами.Единица измерения может быть «Y», «M» или «D»."
                ],
                DATEVALUE: [
                    "DATEVALUE(date_text)",
                    "преобразует дату, хранящуюся в виде текста, в серийный номер, который Excel распознает как дату.Например, формула =DATEVALUE(\"01.01.2008\") возвращает 39448."
                ],
                DAY: [
                    "DAY(serial_number)",
                    "Возвращает день даты, представленный серийным номером."
                ],
                DAYS: [
                    "ДНИ(конечная_дата, начальная_дата)",
                    "Возвращает количество дней между двумя датами."
                ],
                DEGREES: [
                    "DEGREES(angle)",
                    "Преобразует радианы в градусы."
                ],
                EOMONTH: [
                    "ЭОМЕСЯЦ(начальная_дата, месяцы)",
                    "Возвращает серийный номер последнего дня месяца, который равен указанному количеству месяцев до или после start_date."
                ],
                EXP: [
                    "EXP(number)",
                    "Возвращает e, возведенное в числовую степень."
                ],
                FIND: [
                    "НАЙТИ(найти_текст, внутри_текста, [начальный_номер])",
                    "Находит одну текстовую строку внутри второй текстовой строки и возвращает номер начальной позиции первой текстовой строки из первого символа второй текстовой строки."
                ],
                FLOOR: [
                    "ЭТАЖ(число, значение)",
                    "Округляет число вниз, к нулю, до ближайшего кратного значения."
                ],
                HLOOKUP: [
                    "HLOOKUP(искомое_значение, table_array, row_index_num, [range_lookup])",
                    "Ищет значение в верхней строке таблицы или массива значений, а затем возвращает значение в том же столбце из строки, указанной в таблице или массиве."
                ],
                HOUR: [
                    "HOUR(serial_number)",
                    "Возвращает час значения времени.Час задается как целое число в диапазоне от 0 (12:00) до 23 (23:00)."
                ],
                HYPERLINK: [
                    "ГИПЕРССЫЛКА(url, [дружественное_имя])",
                    "создает ярлык, который переходит в другое место в Интернете, когда вы щелкаете ячейку"
                ],
                IF: [
                    "ЕСЛИ(логический_тест, значение_если_истина, [значение_если_ложь])",
                    "возвращает одно значение, если условие истинно, и другое значение, если оно ложно."
                ],
                INDEX: [
                    "ИНДЕКС(массив, номер_строки, [номер_столбца])",
                    "Возвращает значение элемента в таблице или массиве, выбранного по индексам номеров строк и столбцов."
                ],
                INDIRECT: [
                    "ДВССЫЛ(ref_text, [a1])",
                    "Возвращает ссылку, указанную текстовой строкой.Ссылки немедленно оцениваются для отображения их содержимого."
                ],
                ISBLANK: [
                    "ISBLANK(value)",
                    "Возвращает TRUE, если значение пустое"
                ],
                LARGE: [
                    "БОЛЬШОЙ(массив, k)",
                    "Возвращает k-е по величине значение в наборе данных."
                ],
                LEFT: [
                    "ВЛЕВО(текст, [число_символов])",
                    "возвращает первый символ или символы текстовой строки в зависимости от указанного вами количества символов."
                ],
                LEN: [
                    "LEN(text)",
                    "возвращает количество символов в текстовой строке."
                ],
                LOOKUP: [
                    "ПРОСМОТР(искомое_значение, искомый_вектор, [результат_вектор])",
                    "Ищет значение в диапазоне из одной строки или одного столбца (известном как вектор) и возвращает значение из той же позиции во втором диапазоне из одной строки или одного столбца."
                ],
                LOWER: [
                    "LOWER(text)",
                    "Преобразует все заглавные буквы в текстовой строке в строчные."
                ],
                MATCH: [
                    "ПОИСКПОЗ(искомое_значение, искомый_массив, [тип_соответствия])",
                    "Ищет указанный элемент в диапазоне ячеек, а затем возвращает относительную позицию этого элемента в диапазоне.match_type может быть: 0 для точного соответствия с возможностью использования подстановочных знаков;1 (по умолчанию) меньше. Значения в аргументе искомый_массив должны располагаться в порядке возрастания;-1, если значение больше, значения в аргументе искомый_массив должны располагаться в порядке убывания."
                ],
                MAX: [
                    "МАКС(число1, [число2], ...)",
                    "Возвращает наибольшее значение в наборе значений."
                ],
                MEDIAN: [
                    "МЕДИАНА(число1, [число2], ...)",
                    "Возвращает медиану заданных чисел.Медиана — это число, стоящее в середине набора чисел."
                ],
                MID: [
                    "MID(текст, начальный_номер, число_символов)",
                    "возвращает определенное количество символов из текстовой строки, начиная с указанной вами позиции, в зависимости от указанного вами количества символов."
                ],
                MIN: [
                    "МИН(число1, [число2], ...)",
                    "Возвращает наименьшее число в наборе значений."
                ],
                MODE: [
                    "MODE(number1,[number2],...)",
                    "Возвращает наиболее часто встречающееся или повторяющееся значение в массиве или диапазоне данных."
                ],
                MONTH: [
                    "MONTH(serial_number)",
                    "Возвращает месяц даты, представленной серийным номером.Месяц задается как целое число в диапазоне от 1 (январь) до 12 (декабрь)."
                ],
                OR: [
                    "ИЛИ(логический1, [логический2], ...)",
                    "возвращает TRUE, если какой-либо из его аргументов оценивается как TRUE, и возвращает FALSE, если все его аргументы оцениваются как FALSE."
                ],
                PI: [
                    "PI()",
                    "Возвращает число 3,14159265358979, математическую константу Пи."
                ],
                POWER: [
                    "МОЩНОСТЬ(число, мощность)",
                    "Возвращает результат числа, возведенного в степень."
                ],
                PRODUCT: [
                    "ПРОДУКТ(число1, [число2], ...)",
                    "умножает все числа, указанные в качестве аргументов, и возвращает результат.ПРОДУКТ(A1:A3, C1:C3) эквивалентен =A1 * A2 * A3 * C1 * C2 * C3."
                ],
                PROPER: [
                    "PROPER(text)",
                    "Делает первую букву каждого слова текстового значения заглавной."
                ],
                RADIANS: [
                    "RADIANS(angle)",
                    "Преобразует градусы в радианы."
                ],
                RAND: [
                    "RAND()",
                    "Возвращает равномерно распределенное случайное действительное число, большее или равное 0, но меньше 1."
                ],
                RANK: [
                    "RANK(number,ref,[order])",
                    "Возвращает ранг числа в списке чисел."
                ],
                RATE: [
                    "",
                    ""
                ],
                REPLACE: [
                    "ЗАМЕНИТЬ(старый_текст, начальный_номер, число_символов, новый_текст)",
                    "заменяет часть текстовой строки в зависимости от указанного вами количества символов другой текстовой строкой."
                ],
                REPT: [
                    "ПОВТОР(текст, число_раз)",
                    "Повторяет текст заданное количество раз."
                ],
                RIGHT: [
                    "RIGHT(text,[num_chars])",
                    "возвращает последний символ или символы текстовой строки в зависимости от указанного вами количества символов."
                ],
                ROUND: [
                    "ОКРУГЛ(число; количество_цифр)",
                    "округляет число до заданного количества цифр."
                ],
                ROUNDDOWN: [
                    "ОКРУГЛ ВНИЗ(число, количество_цифр)",
                    "Округляет число вниз, к нулю."
                ],
                ROUNDUP: [
                    "ОКРУГЛВВЕРХ(число; количество_цифр)",
                    "Округляет число в большую сторону от 0 (нуля)."
                ],
                ROW: [
                    "ROW()",
                    "Возвращает ссылку на ячейку, в которой присутствует функция СТРОКА."
                ],
                ROWS: [
                    "ROWS(array)",
                    "Возвращает количество строк в ссылке или массиве."
                ],
                SEARCH: [
                    "SEARCH(find_text,within_text,[start_num])",
                    "найдите одну текстовую строку внутри второй текстовой строки и верните номер начальной позиции первой текстовой строки из первого символа второй текстовой строки."
                ],
                SIN: [
                    "SIN(number)",
                    "Возвращает синус заданного угла (в радианах)."
                ],
                SMALL: [
                    "МАЛЕНЬКИЙ(массив, k)",
                    "Возвращает k-ое наименьшее значение в наборе данных."
                ],
                SQRT: [
                    "SQRT(number)",
                    "Возвращает положительный квадратный корень."
                ],
                STDEV: [
                    "STDEV(number1,[number2],...)",
                    "Оценивает стандартное отклонение на основе выборки.Стандартное отклонение — это мера того, насколько сильно значения отклоняются от среднего значения (среднего значения)."
                ],
                STDEVP: [
                    "STDEVP(number1,[number2],...)",
                    "Вычисляет стандартное отклонение на основе всей генеральной совокупности, заданной в качестве аргументов."
                ],
                SUBSTITUTE: [
                    "ПОДСТАВИТЬ(текст, старый_текст, новый_текст, [номер_экземпляра])",
                    "Заменяет новый_текст на старый_текст в текстовой строке."
                ],
                SUM: [
                    "SUM(number1,[number2],...)",
                    "Добавляет свои аргументы.Вы можете добавить отдельные значения, ссылки на ячейки или диапазоны или сочетание всех трех."
                ],
                SUMIF: [
                    "СУММЕСЛИ(диапазон, критерии, [диапазон_суммы])",
                    "добавляет значения в диапазон, соответствующие указанным вами критериям."
                ],
                SUMIFS: [
                    "СУММИС(диапазон_суммы, диапазон_критериев1, критерий1, [диапазон_критериев2, критерий2], ...)",
                    "добавляет все свои аргументы, соответствующие нескольким критериям."
                ],
                SUMPRODUCT: [
                    "СУММПРОИЗВ(массив1, [массив2], [массив3], ...)",
                    "Умножает соответствующие компоненты в заданных массивах и возвращает сумму этих произведений."
                ],
                TAN: [
                    "TAN(number)",
                    "Возвращает тангенс заданного угла (в радианах)."
                ],
                TEXT: [
                    "ТЕКСТ(значение, которое вы хотите отформатировать, «Код формата, который вы хотите применить»)",
                    "Функция ТЕКСТ позволяет изменить способ отображения числа, применив к нему форматирование с помощью кодов формата."
                ],
                TIME: [
                    "ВРЕМЯ(час, минута, секунда)",
                    "Возвращает десятичное число для определенного времени."
                ],
                TIMEVALUE: [
                    "TIMEVALUE(time_text)",
                    "Возвращает десятичное число времени, представленное текстовой строкой.Десятичное число представляет собой значение в диапазоне от 0 (нуля) до 0,99988426, обозначающее время от 0:00:00 (12:00:00) до 23:59:59 (23:59:59)."
                ],
                TODAY: [
                    "TODAY()",
                    "Возвращает серийный номер текущей даты."
                ],
                TRIM: [
                    "TRIM(text)",
                    "Удаляет из текста все пробелы, кроме одиночных пробелов между словами."
                ],
                TRUNC: [
                    "TRUNC(число, [число_цифр])",
                    "Усекает число до целого числа, удаляя дробную часть числа."
                ],
                UPPER: [
                    "UPPER(text)",
                    "Преобразует текст в верхний регистр."
                ],
                VALUE: [
                    "VALUE(text)",
                    "Преобразует текстовую строку, представляющую число, в число."
                ],
                VAR: [
                    "VAR(number1,[number2],...)",
                    "Оценивает дисперсию на основе выборки."
                ],
                VARP: [
                    "VARP(number1,[number2],...)",
                    "Вычисляет дисперсию на основе всей генеральной совокупности."
                ],
                VLOOKUP: [
                    "ВПР (искомое_значение, table_array, col_index_num, [range_lookup])",
                    "искать значение в таблице или диапазоне по строкам.Например, найдите цену автомобильной детали по номеру детали."
                ],
                YEAR: [
                    "YEAR(serial_number)",
                    "Возвращает год, соответствующий дате.Год возвращается как целое число в диапазоне 1900–9999."
                ]
            },
            strFreezeFirstCol: "Заморозить первый столбец",
            strFreezePanes: "Зафиксировать панели",
            strFreezePanesUndo: "Разморозить панели",
            strFreezeTopRow: "Заморозить первую строку",
            strFrozenCols: "Замороженные колонны",
            strFrozenRows: "Замороженные строки",
            strFullScreen: "Полный экран",
            strGroup_fixCols: "Исправить столбцы",
            strGroup_grandSummary: "Общее резюме",
            strGroup_header: "Удалить группу по столбцу",
            strGroup_merge: "Объединить ячейки",
            strHideCols: "Скрыть столбцы",
            strHideRows: "Скрыть строки",
            strImport: "Импортировать данные",
            strImportPic: "Вставить плавающее изображение",
            strImportPicCell: "Вставить изображение в ячейку",
            strInsertColumn: "Вставить столбец",
            strInsertRow: "Вставить строку",
            strInsertRows: "Вставить {0} строк",
            strItalic: "Курсивный текст",
            strLabel: "Этикетка",
            strLink: "Ссылка",
            strLoading: "Загрузка",
            strLocal: "ru",
            strLockCells: "Замковые ячейки",
            strMenu: {
                export: "Экспортируемые столбцы",
                filter: "Фильтр",
                hideCols: "Видимые столбцы"
            },
            strMerge: "Объединить ячейки",
            strName: "Имя",
            strNextResult: "Следующий",
            strNoRows: "Нет строк для отображения.",
            strNothingFound: "Ничего не найдено",
            strOR: "ИЛИ",
            strOk: "Хорошо",
            strOpen: "Открыть",
            strPaste: "Вставить",
            strPrevResult: "Предыдущий",
            strRedo: "Повторить",
            strRename: "Переименовать",
            strSearch: "Поиск",
            strSelectAll: "Выбрать все",
            strSelectedmatches: "Выделено {0} из {1}",
            strShowCols: "Показать столбцы",
            strShowRows: "Показать строки",
            strTP_aggPH: "Удаление столбцов для агрегатов",
            strTP_aggPane: "Агрегаты",
            strTP_colPH: "Удаление столбцов для группировки столбцов",
            strTP_colPane: "Группировать столбцы",
            strTP_pivot: "Режим поворота",
            strTP_rowPH: "Удаление столбцов для группировки строк",
            strTP_rowPane: "Группировать строки",
            strTabAdd: "Новый лист",
            strTabClose: "Удалить лист",
            strTabHide: "Скрыть лист",
            strTabName: "sheet{0}",
            strTabRemove: "{0} будет удален без возможности восстановления.\r\nВы уверены?",
            strTabRename: "Переименовать лист",
            strTabShow: "Показать лист",
            strTextColor: "Цвет текста",
            strUnderline: "Подчеркивание текста",
            strUndo: "Отменить",
            strUnhide: "Показать",
            strUnmerge: "Разъединить ячейки",
            strUpdate: "Обновить",
            strWrap: "Перенос текста"
        },
        pager = pq.pqPager.regional.ru = {
            strDisplay: "Строки с {0} по {1} из {2}.",
            strFirstPage: "Первая страница",
            strLastPage: "Последняя страница",
            strNextPage: "Следующая страница",
            strPage: "Страница {0} из {1}",
            strPrevPage: "Предыдущая страница",
            strRefresh: "Обновить",
            strRpp: "Строк на странице: {0}"
        };

    $.extend(pq.pqGrid.defaults, grid);
    $.extend(pq.pqPager.defaults, pager);

})();