(function() {
    let $;
    if (typeof require == "function" && typeof module == "object") {
        $ = typeof jQuery != "undefined" ? jQuery : require("pqgrid").$;
    } else {
        $ = window.jQuery;
    }

    var pq = $.paramquery,
        grid = pq.strings = pq.pqGrid.regional.ar = {
            strAND: "و",
            strAddColLeft: "إضافة العمود الأيسر",
            strAddColRight: "أضف العمود الأيمن",
            strAddColumn: "إضافة عمود",
            strAddRow: "إضافة صف",
            strAddRowAbove: "أضف صفًا أعلاه",
            strAddRowBelow: "أضف صفًا أدناه",
            strAddRows: "أضف {0} صفًا",
            strAlign: {
                bottom: "محاذاة أسفل",
                center: "محاذاة للوسط",
                left: "محاذاة لليسار",
                right: "محاذاة إلى اليمين",
                top: "محاذاة أعلى"
            },
            strAlignH: "المحاذاة الأفقية",
            strAlignV: "المحاذاة العمودية",
            strApply: "تطبيق",
            strBlanks: "(الفراغات)",
            strBold: "نص غامق",
            strBorder: "الحدود",
            strBorderColor: "لون الحدود",
            strBorderStyle: "نمط الحدود",
            strBorders: {
                all: "جميع الحدود",
                bottom: "الحدود السفلية",
                horizontal: "الحدود الأفقية",
                inner: "الحدود الداخلية",
                left: "الحدود اليسرى",
                none: "لا الحدود",
                outer: "الحدود الخارجية",
                right: "الحدود اليمنى",
                top: "الحدود العليا",
                vertical: "الحدود العمودية"
            },
            strCancel: "إلغاء",
            strClear: "واضح",
            strClearColor: "لون واضح",
            strClearFilter: "مسح التصفية",
            strClearText: "مسح النص",
            strCollapse: "طي اللوحة",
            strComment: "التعليق",
            strCondition: "Condition:",
            strConditions: {
                "": "-- لا يوجد --",
                begin: "يبدأ ب",
                between: "بينهما",
                contain: "يحتوي على",
                empty: "فارغ",
                end: "ينتهي ب",
                equal: "يساوي",
                great: "أعظم من",
                gte: "أكبر من أو يساوي",
                less: "أقل من",
                lte: "أقل من أو يساوي",
                notbegin: "لا يبدأ بـ",
                notcontain: "لا يحتوي",
                notempty: "ليست فارغة",
                notend: "لا ينتهي ب",
                notequal: "لا يساوي",
                range: "[ المدى ]",
                regexp: "التعبير العادي"
            },
            strCopy: "نسخ",
            strCut: "قطع",
            strDelete: "حذف",
            strDeleteColumn: "حذف العمود",
            strDeleteRow: "حذف الصف",
            strDownloadXlsx: "تحميل ملف اكسل",
            strEdit: "تحرير",
            strExitFullScreen: "الخروج من وضع ملء الشاشة",
            strExpand: "قم بتوسيع اللوحة",
            strExport: "تصدير البيانات",
            strFillColor: "لون التعبئة",
            strFontFamily: "عائلة الخطوط",
            strFontSize: "حجم الخط",
            strFormat: "تنسيق الخلايا",
            strFormatMenu: {
                Accounting: "المحاسبة",
                Currency: "العملة",
                Custom: "مخصص",
                DateTime: "التاريخ والوقت",
                Fixed: "عشري",
                Fraction: "جزء",
                FullDate: "التاريخ الكامل",
                General: "عام",
                Int: "عدد صحيح",
                LongDate: "تاريخ طويل",
                MediumDate: "تاريخ متوسط",
                Note: "ملاحظة: تتغير التنسيقات التي تحتوي على * وفقًا للغة المستخدم.",
                Percent: "النسبة المئوية",
                Scientific: "علمية",
                ShortDate: "تاريخ قصير",
                Standard: "قياسي",
                Text: "نص",
                Time: "الوقت"
            },
            strFormulas: {
                ABS: [
                    "ABS(number)",
                    "إرجاع القيمة المطلقة لرقم.القيمة المطلقة للرقم هي الرقم بدون إشارته."
                ],
                ACOS: [
                    "ACOS(number)",
                    "إرجاع قوس جيب التمام أو جيب التمام العكسي لأحد الأرقام.أركوسين هي الزاوية التي جيب تمامها هو الرقم.يتم إعطاء الزاوية المرتجعة بالراديان في النطاق من 0 (صفر) إلى pi."
                ],
                AND: [
                    "و(منطقي 1، [منطقي 2]، ...)",
                    "إرجاع TRUE إذا تم تقييم كافة الوسائط الخاصة به إلى TRUE، وإرجاع FALSE إذا تم تقييم وسيطة واحدة أو أكثر إلى FALSE."
                ],
                ASIN: [
                    "ASIN(number)",
                    "إرجاع قوس الجيب، أو جيب الجيب العكسي لرقم.قوس الجيب هو الزاوية التي جيبها هو الرقم.يتم إعطاء الزاوية التي تم إرجاعها بالراديان في النطاق -pi/2 إلى pi/2."
                ],
                ATAN: [
                    "ATAN(number)",
                    "إرجاع المماس العكسي أو المماس العكسي لعدد ما.المماس القوسي هو الزاوية التي ظلها رقم.يتم إعطاء الزاوية التي تم إرجاعها بالراديان في النطاق -pi/2 إلى pi/2."
                ],
                AVERAGE: [
                    "المتوسط (رقم 1، [رقم 2]، ...)",
                    "إرجاع المتوسط (الوسط الحسابي) للوسائط.على سبيل المثال، إذا كان النطاق A1:A20 يحتوي على أرقام، فإن الصيغة =AVERAGE(A1:A20) ترجع متوسط ​​تلك الأرقام."
                ],
                AVERAGEIF: [
                    "AVERAGEIF(النطاق، المعايير، [average_range])",
                    "إرجاع المتوسط (المتوسط الحسابي) لجميع الخلايا الموجودة في نطاق يلبي معايير معينة."
                ],
                AVERAGEIFS: [
                    "AVERAGEIFS (متوسط_النطاق، معايير_نطاق1، معايير1، [معايير_نطاق2، معايير2]، ...)",
                    "إرجاع المتوسط (المتوسط الحسابي) لجميع الخلايا التي تفي بمعايير متعددة."
                ],
                CEILING: [
                    "السقف (الرقم، الأهمية)",
                    "إرجاع رقم مقرب لأعلى، بعيدًا عن الصفر، إلى أقرب مضاعف ذي أهمية.على سبيل المثال، إذا كنت تريد تجنب استخدام البنسات في أسعارك وكان سعر منتجك هو 4.42 دولار، فاستخدم الصيغة =CEILING(4.42,0.05) لتقريب الأسعار إلى أقرب نيكل."
                ],
                CHAR: [
                    "CHAR(number)",
                    "إرجاع الحرف المحدد برقم."
                ],
                CHOOSE: [
                    "اختر (index_num، value1، [value2]، ...)",
                    "إذا كانت قيمة Index_num تساوي 1، فتُرجع CHOOSE القيمة 1؛إذا كانت 2، تقوم CHOOSE بإرجاع القيمة 2؛وهكذا."
                ],
                CODE: [
                    "CODE(text)",
                    "إرجاع رمز رقمي للحرف الأول في سلسلة نصية."
                ],
                COLUMN: [
                    "COLUMN()",
                    "إرجاع مرجع الخلية التي تظهر فيها الدالة COLUMN."
                ],
                COLUMNS: [
                    "COLUMNS(array)",
                    "إرجاع عدد الأعمدة في صفيف أو مرجع."
                ],
                CONCATENATE: [
                    "سلسلة (نص 1، [نص 2]، ...)",
                    "ضم سلسلتين نصيتين أو أكثر في سلسلة واحدة."
                ],
                COS: [
                    "COS(number)",
                    "إرجاع جيب التمام للزاوية المحددة (بالراديان)."
                ],
                COUNT: [
                    "الكونت (القيمة 1، [القيمة 2]، ...)",
                    "حساب عدد الخلايا التي تحتوي على أرقام، وحساب الأرقام الموجودة ضمن قائمة الوسائط."
                ],
                COUNTA: [
                    "كونتا(القيمة1، [القيمة2]، ...)",
                    "تقوم الدالة COUNTA بحساب عدد الخلايا غير الفارغة في النطاق."
                ],
                COUNTBLANK: [
                    "COUNTBLANK(range)",
                    "حساب الخلايا الفارغة في نطاق محدد من الخلايا."
                ],
                COUNTIF: [
                    "COUNTIF (النطاق، المعايير)",
                    "يحسب عدد الخلايا التي تفي بالمعيار؛على سبيل المثال، لحساب عدد المرات التي تظهر فيها مدينة معينة في قائمة العملاء."
                ],
                COUNTIFS: [
                    "COUNTIFS (criteria_range1، ومعايير 1، [criteria_range2، ومعايير 2] ...)",
                    "تطبيق المعايير على الخلايا عبر نطاقات متعددة وحساب عدد المرات التي يتم فيها استيفاء كافة المعايير."
                ],
                DATE: [
                    "DATE(year,month,day)",
                    "إرجاع الرقم التسلسلي المتسلسل الذي يمثل تاريخًا معينًا."
                ],
                DATEDIF: [
                    "DATEDIF(start_date,end_date,unit)",
                    "حساب عدد الأيام أو الأشهر أو السنوات بين تاريخين.يمكن أن تكون الوحدة \"Y\" أو \"M\" أو \"D\"."
                ],
                DATEVALUE: [
                    "DATEVALUE(date_text)",
                    "يحول التاريخ المخزن كنص إلى رقم تسلسلي يتعرف عليه Excel كتاريخ.على سبيل المثال، ترجع الصيغة =DATEVALUE(\"1/1/2008\") 39448."
                ],
                DAY: [
                    "DAY(serial_number)",
                    "إرجاع يوم من التاريخ، ممثلاً برقم تسلسلي."
                ],
                DAYS: [
                    "DAYS(end_date، start_date)",
                    "إرجاع عدد الأيام بين تاريخين."
                ],
                DEGREES: [
                    "DEGREES(angle)",
                    "تحويل الراديان إلى درجات."
                ],
                EOMONTH: [
                    "EOMONTH (تاريخ_البدء، الأشهر)",
                    "إرجاع الرقم التسلسلي لليوم الأخير من الشهر الذي يمثل عدد الأشهر المشار إليه قبل تاريخ البدء أو بعده."
                ],
                EXP: [
                    "EXP(number)",
                    "إرجاع e مرفوعًا إلى قوة الرقم."
                ],
                FIND: [
                    "ابحث عن (find_text، inside_text، [start_num])",
                    "يحدد موقع سلسلة نصية واحدة داخل سلسلة نصية ثانية، ويعيد رقم موضع البداية للسلسلة النصية الأولى من الحرف الأول للسلسلة النصية الثانية."
                ],
                FLOOR: [
                    "الطابق (الرقم، الأهمية)",
                    "لتقريب الرقم للأسفل، باتجاه الصفر، إلى أقرب مضاعف ذي أهمية."
                ],
                HLOOKUP: [
                    "HLOOKUP(lookup_value، table_array،row_index_num، [range_lookup])",
                    "يبحث عن قيمة في الصف العلوي من جدول أو مصفوفة قيم، ثم يُرجع قيمة في نفس العمود من صف تحدده في الجدول أو المصفوفة."
                ],
                HOUR: [
                    "HOUR(serial_number)",
                    "إرجاع الساعة بقيمة زمنية.يتم إعطاء الساعة كعدد صحيح، يتراوح من 0 (12:00 صباحًا) إلى 23 (11:00 مساءً)."
                ],
                HYPERLINK: [
                    "الارتباط التشعبي (عنوان URL، [اسم_صديق])",
                    "ينشئ اختصارًا ينتقل إلى موقع آخر على الإنترنت عند النقر فوق خلية"
                ],
                IF: [
                    "إذا (اختبار منطقي، قيمة_إذا_صحيح، [قيمة_إذا_خطأ])",
                    "تُرجع قيمة واحدة إذا كان الشرط صحيحًا وقيمة أخرى إذا كان خطأً."
                ],
                INDEX: [
                    "INDEX(صفيف،row_num،[column_num])",
                    "إرجاع قيمة عنصر في جدول أو مصفوفة، يتم تحديده بواسطة فهارس أرقام الصفوف والأعمدة."
                ],
                INDIRECT: [
                    "غير مباشر (ref_text، [a1])",
                    "إرجاع المرجع المحدد بواسطة سلسلة نصية.يتم تقييم المراجع بشكل فوري لعرض محتوياتها."
                ],
                ISBLANK: [
                    "ISBLANK(value)",
                    "إرجاع TRUE إذا كانت القيمة فارغة"
                ],
                LARGE: [
                    "كبير (صفيف، ك)",
                    "إرجاع أكبر قيمة k في مجموعة بيانات."
                ],
                LEFT: [
                    "LEFT(نص، [num_chars])",
                    "إرجاع الحرف أو الأحرف الأولى في سلسلة نصية، بناءً على عدد الأحرف التي تحددها."
                ],
                LEN: [
                    "LEN(text)",
                    "إرجاع عدد الأحرف في سلسلة نصية."
                ],
                LOOKUP: [
                    "LOOKUP (قيمة_lookup، lookup_vector، [result_vector])",
                    "يبحث في نطاق من صف واحد أو عمود واحد (يُعرف بالمتجه) عن قيمة ويعيد قيمة من نفس الموضع في نطاق ثانٍ من صف واحد أو عمود واحد."
                ],
                LOWER: [
                    "LOWER(text)",
                    "تحويل كافة الأحرف الكبيرة في سلسلة نصية إلى أحرف صغيرة."
                ],
                MATCH: [
                    "MATCH(lookup_value، lookup_array، [match_type])",
                    "يبحث عن عنصر محدد في نطاق من الخلايا، ثم يُرجع الموضع النسبي لهذا العنصر في النطاق.يمكن أن يكون نوع match_type: 0 للمطابقة التامة مع خيار استخدام أحرف البدل؛1 (افتراضي) لأقل من، يجب وضع القيم الموجودة في وسيطة lookup_array بترتيب تصاعدي؛-1 إذا كانت أكبر من، يجب وضع القيم الموجودة في وسيطة lookup_array بترتيب تنازلي."
                ],
                MAX: [
                    "الحد الأقصى (رقم 1، [رقم 2]، ...)",
                    "إرجاع أكبر قيمة في مجموعة من القيم."
                ],
                MEDIAN: [
                    "الوسيط (رقم 1، [رقم 2]، ...)",
                    "إرجاع الوسيط للأرقام المحددة.الوسيط هو الرقم الموجود في وسط مجموعة من الأرقام."
                ],
                MID: [
                    "MID(نص، start_num، num_chars)",
                    "تقوم بإرجاع عدد محدد من الأحرف من سلسلة نصية، بدءًا من الموضع الذي تحدده، بناءً على عدد الأحرف الذي تحدده."
                ],
                MIN: [
                    "مين (رقم 1، [رقم 2]، ...)",
                    "إرجاع أصغر رقم في مجموعة من القيم."
                ],
                MODE: [
                    "MODE(number1,[number2],...)",
                    "إرجاع القيمة الأكثر تكرارًا أو حدوثًا في صفيف أو نطاق من البيانات."
                ],
                MONTH: [
                    "MONTH(serial_number)",
                    "إرجاع شهر من تاريخ يمثله رقم تسلسلي.يتم إعطاء الشهر كعدد صحيح، يتراوح من 1 (يناير) إلى 12 (ديسمبر)."
                ],
                OR: [
                    "أو (منطقي 1، [منطقي 2]، ...)",
                    "تُرجع TRUE إذا تم تقييم أي من وسيطاتها إلى TRUE، وتُرجع FALSE إذا تم تقييم جميع وسيطاتها إلى FALSE."
                ],
                PI: [
                    "PI()",
                    "تُرجع الرقم 3.14159265358979، وهو الثابت الرياضي pi."
                ],
                POWER: [
                    "الطاقة (الرقم، الطاقة)",
                    "إرجاع نتيجة رقم مرفوع إلى قوة."
                ],
                PRODUCT: [
                    "المنتج (رقم 1، [رقم 2]، ...)",
                    "ضرب جميع الأرقام المعطاة كوسيطات وإرجاع المنتج.المنتج (A1:A3, C1:C3) يعادل =A1 * A2 * A3 * C1 * C2 * C3."
                ],
                PROPER: [
                    "PROPER(text)",
                    "تكبير الحرف الأول في كل كلمة من قيمة النص."
                ],
                RADIANS: [
                    "RADIANS(angle)",
                    "تحويل الدرجات إلى راديان."
                ],
                RAND: [
                    "RAND()",
                    "إرجاع رقم حقيقي عشوائي موزع بالتساوي أكبر من أو يساوي 0 وأقل من 1."
                ],
                RANK: [
                    "RANK(number,ref,[order])",
                    "إرجاع ترتيب رقم في قائمة الأرقام."
                ],
                RATE: [
                    "",
                    ""
                ],
                REPLACE: [
                    "استبدال (old_text، start_num، num_chars، new_text)",
                    "يستبدل جزءًا من سلسلة نصية، بناءً على عدد الأحرف التي تحددها، بسلسلة نصية مختلفة."
                ],
                REPT: [
                    "REPT (نص، number_times)",
                    "يكرر النص عدد معين من المرات."
                ],
                RIGHT: [
                    "RIGHT(text,[num_chars])",
                    "تقوم بإرجاع الحرف أو الأحرف الأخيرة في سلسلة نصية، بناءً على عدد الأحرف التي تحددها."
                ],
                ROUND: [
                    "ROUND(رقم، num_digits)",
                    "تقريب رقم إلى عدد محدد من الأرقام."
                ],
                ROUNDDOWN: [
                    "ROUNDDOWN(رقم، num_digits)",
                    "لتقريب رقم للأسفل باتجاه الصفر."
                ],
                ROUNDUP: [
                    "ROUNDUP(الرقم، num_digits)",
                    "تقريب رقم لأعلى، بعيدًا عن 0 (صفر)."
                ],
                ROW: [
                    "ROW()",
                    "إرجاع مرجع الخلية التي تظهر فيها الدالة ROW."
                ],
                ROWS: [
                    "ROWS(array)",
                    "إرجاع عدد الصفوف في مرجع أو صفيف."
                ],
                SEARCH: [
                    "SEARCH(find_text,within_text,[start_num])",
                    "حدد موقع سلسلة نصية واحدة داخل سلسلة نصية ثانية، وقم بإرجاع رقم موضع البداية للسلسلة النصية الأولى من الحرف الأول للسلسلة النصية الثانية."
                ],
                SIN: [
                    "SIN(number)",
                    "إرجاع جيب الزاوية المحددة (بالراديان)."
                ],
                SMALL: [
                    "صغير (صفيف، ك)",
                    "إرجاع أصغر قيمة k-th في مجموعة بيانات."
                ],
                SQRT: [
                    "SQRT(number)",
                    "إرجاع جذر تربيعي موجب."
                ],
                STDEV: [
                    "STDEV(number1,[number2],...)",
                    "تقدير الانحراف المعياري بناءً على العينة.الانحراف المعياري هو مقياس لمدى انتشار القيم عن القيمة المتوسطة (المتوسط)."
                ],
                STDEVP: [
                    "STDEVP(number1,[number2],...)",
                    "لحساب الانحراف المعياري بناءً على المحتوى بأكمله المقدم كوسيطات."
                ],
                SUBSTITUTE: [
                    "SUBSTITUTE(text، old_text، new_text، [instance_num])",
                    "يستبدل new_text بالنص القديم في سلسلة نصية."
                ],
                SUM: [
                    "SUM(number1,[number2],...)",
                    "يضيف الحجج الخاصة به.يمكنك إضافة قيم فردية أو مراجع خلايا أو نطاقات أو مزيج من الثلاثة."
                ],
                SUMIF: [
                    "SUMIF(النطاق، المعايير، [sum_range])",
                    "يضيف القيم الموجودة في نطاق يفي بالمعايير التي تحددها"
                ],
                SUMIFS: [
                    "SUMIFS(sum_range، ومعايير_نطاق1، ومعايير1، [معايير_نطاق2، ومعايير2]، ...)",
                    "يضيف كافة الوسائط التي تلبي معايير متعددة."
                ],
                SUMPRODUCT: [
                    "SUMPRODUCT(array1, [array2], [array3], ...)",
                    "ضرب المكونات المقابلة في المصفوفات المحددة، وإرجاع مجموع تلك المنتجات."
                ],
                TAN: [
                    "TAN(number)",
                    "إرجاع ظل الزاوية المحددة (بالراديان)."
                ],
                TEXT: [
                    "نص (القيمة التي تريد تنسيقها، \"تنسيق الكود الذي تريد تطبيقه\")",
                    "تتيح لك وظيفة TEXT تغيير الطريقة التي يظهر بها الرقم من خلال تطبيق التنسيق عليه باستخدام رموز التنسيق."
                ],
                TIME: [
                    "الوقت (ساعة، دقيقة، ثانية)",
                    "إرجاع الرقم العشري لفترة معينة."
                ],
                TIMEVALUE: [
                    "TIMEVALUE(time_text)",
                    "إرجاع الرقم العشري للوقت الذي تمثله سلسلة نصية.الرقم العشري هو قيمة تتراوح من 0 (صفر) إلى 0.99988426، وهو ما يمثل الأوقات من 0:00:00 (12:00:00 ص) إلى 23:59:59 (11:59:59 م)."
                ],
                TODAY: [
                    "TODAY()",
                    "إرجاع الرقم التسلسلي للتاريخ الحالي."
                ],
                TRIM: [
                    "TRIM(text)",
                    "يزيل كافة المسافات من النص باستثناء المسافات المفردة بين الكلمات."
                ],
                TRUNC: [
                    "TRUNC(رقم، [num_digits])",
                    "اقتطاع رقم إلى عدد صحيح عن طريق إزالة الجزء الكسري من الرقم."
                ],
                UPPER: [
                    "UPPER(text)",
                    "تحويل النص إلى أحرف كبيرة."
                ],
                VALUE: [
                    "VALUE(text)",
                    "تحويل سلسلة نصية تمثل رقمًا إلى رقم."
                ],
                VAR: [
                    "VAR(number1,[number2],...)",
                    "تقديرات التباين على أساس العينة."
                ],
                VARP: [
                    "VARP(number1,[number2],...)",
                    "حساب التباين بناءً على إجمالي عدد السكان."
                ],
                VLOOKUP: [
                    "VLOOKUP (lookup_value، table_array، col_index_num، [range_lookup])",
                    "ابحث عن قيمة في جدول أو نطاق حسب الصف.على سبيل المثال، ابحث عن سعر قطعة غيار السيارات من خلال رقم القطعة."
                ],
                YEAR: [
                    "YEAR(serial_number)",
                    "إرجاع السنة المقابلة لتاريخ ما.يتم إرجاع السنة كعدد صحيح في النطاق 1900-9999."
                ]
            },
            strFreezeFirstCol: "تجميد العمود الأول",
            strFreezePanes: "تجميد الأجزاء",
            strFreezePanesUndo: "قم بإلغاء تجميد الأجزاء",
            strFreezeTopRow: "تجميد الصف الأول",
            strFrozenCols: "الأعمدة المجمدة",
            strFrozenRows: "الصفوف المجمدة",
            strFullScreen: "شاشة كاملة",
            strGroup_fixCols: "إصلاح الأعمدة",
            strGroup_grandSummary: "ملخص كبير",
            strGroup_header: "قم بإسقاط المجموعة حسب العمود",
            strGroup_merge: "دمج الخلايا",
            strHideCols: "إخفاء الأعمدة",
            strHideRows: "إخفاء الصفوف",
            strImport: "استيراد البيانات",
            strImportPic: "إدراج صورة عائمة",
            strImportPicCell: "إدراج صورة في الخلية",
            strInsertColumn: "إدراج عمود",
            strInsertRow: "إدراج صف",
            strInsertRows: "أدخل {0} صفًا",
            strItalic: "نص مائل",
            strLabel: "التسمية",
            strLink: "رابط",
            strLoading: "جاري التحميل",
            strLocal: "ar",
            strLockCells: "قفل الخلايا",
            strMenu: {
                export: "أعمدة قابلة للتصدير",
                filter: "تصفية",
                hideCols: "أعمدة مرئية"
            },
            strMerge: "دمج الخلايا",
            strName: "الاسم",
            strNextResult: "النتيجة التالية",
            strNoRows: "لا توجد صفوف لعرضها.",
            strNothingFound: "لم يتم العثور على شيء",
            strOR: "أو",
            strOk: "حسنًا",
            strOpen: "مفتوح",
            strPaste: "لصق",
            strPrevResult: "النتيجة السابقة",
            strRedo: "إعادة",
            strRename: "إعادة تسمية",
            strSearch: "بحث",
            strSelectAll: "حدد الكل",
            strSelectedmatches: "تم تحديد {0} من أصل {1} من التطابقات",
            strShowCols: "إظهار الأعمدة",
            strShowRows: "إظهار الصفوف",
            strTP_aggPH: "إسقاط الأعمدة للمجاميع",
            strTP_aggPane: "المجاميع",
            strTP_colPH: "قم بإسقاط الأعمدة لتجميع الأعمدة",
            strTP_colPane: "أعمدة المجموعة",
            strTP_pivot: "الوضع المحوري",
            strTP_rowPH: "قم بإسقاط الأعمدة لتجميع الصفوف",
            strTP_rowPane: "صفوف المجموعة",
            strTabAdd: "ورقة جديدة",
            strTabClose: "إزالة الورقة",
            strTabHide: "إخفاء الورقة",
            strTabName: "sheet{0}",
            strTabRemove: "سيتم حذف {0} نهائيًا.\r\nهل أنت متأكد؟",
            strTabRename: "إعادة تسمية الورقة",
            strTabShow: "عرض الورقة",
            strTextColor: "لون النص",
            strUnderline: "تسطير النص",
            strUndo: "تراجع",
            strUnhide: "إظهار",
            strUnmerge: "إلغاء دمج الخلايا",
            strUpdate: "تحديث",
            strWrap: "التفاف النص"
        },
        pager = pq.pqPager.regional.ar = {
            strDisplay: "عرض {0} إلى {1} من أصل {2} عنصر.",
            strFirstPage: "الصفحة الأولى",
            strLastPage: "الصفحة الأخيرة",
            strNextPage: "الصفحة التالية",
            strPage: "الصفحة {0} من {1}",
            strPrevPage: "الصفحة السابقة",
            strRefresh: "تحديث",
            strRpp: "السجلات لكل صفحة: {0}"
        };

    $.extend(pq.pqGrid.defaults, grid);
    $.extend(pq.pqPager.defaults, pager);

})();